CSI API ETABS v1

# eForce Enumeration

---

The force units that can be specified for the model.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eForce

    Public Enumeration eForce

    Dim instance As eForce

    public enum class eForce

    type eForce

Members

| Member name| Value| Description
---|---|---|---
| NotApplicable| 0|
| lb| 1|
| kip| 2|
| N| 3|
| kN| 4|
| kgf| 5|
| tonf| 6|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com